<!DOCTYPE html>
	<head>
	<title>Mini-Projekt</title>
	<meta http-equiv="content-type" content="text/html; charset=UTF-8">
	<meta name="version" content="1.0">
	<link rel="stylesheet" type="text/css" href="./style.css">
	<script src="../script.js"></script>
	</head>
	<body>
		<article>
			<hgroup>
				<h1 id="title">Koch- und Sachb&uuml;cher</h1>
				<h2 id="subtitle">Entwicklung vom Altertum bis in die Neuzeit und Moderne</h2>
				<p class="author">Jonas Wallmann</p>
				<p class="author">Patrick Kachelmuss</p>
				<p class="author">Kai Durst</p>
				<h3 id="abstract">Der nachfolgende Text soll dem Leser die geschichtliche Entwicklung des Sachbuches und insbesondere die des Kochbuches aufzeigen. Angefangen von den ersten Erw&auml;hnungen in der Antike über das Mittelalter bis hin zur Moderne und Neuzeit. Dem Leser soll vor allem die inhaltliche Entwicklung der beiden Buchgattungen vermittelt werden, diese Entwicklung umfasst die &Auml;nderungen in Bezug auf die Formulierung der Inhalte und deren gesellschaftliche und kulturelle Einordnung. Ebenso die Ver&auml;nderung im Bezug auf die Leserschaft: zuerst dem Adel und Klerus &uuml;ber die besser betuchten Schichten der Gesellschaft bis hin zum B&uuml;rgertum und den einfacheren sozialen Schichten. Hauptaugenmerk liegt hierbei auf der Entwicklung im europ&auml;ischen Umfeld. 
                </h3>
			</hgroup>
			<section id="main">
				<h1>Haupttext</h1>
                <h2>Generelle Grundlagen und Begrifflichkeiten</h2>
                <p> 
                Das Sachbuch stellt das Gegenst&uuml;ck zur Belletristik in der Literatur dar. Es ist neben dem Lehrbuch und Fachbuch ein wichtiger Bestandteil der nicht-belletristischen Literatur. Im Gegensatz zum Lehrbuch hat es keinen grunds&auml;tzlich didaktischen Anspruch. Ebenso ist der Inhalt des Sachbuches gegen&uuml;ber der Fachliteratur ohne spezielle Vorkenntnisse auch von Laien zu verstehen und bedarf keiner fachspezifischen Bildung (bspw. handwerklich oder akademisch). <br>
                Sachb&uuml;cher lassen sich prinzipiell in die folgenden Kategorien einsortiert werden, die dann wiederrum feiner unterteilt werden: 
                </p>
                <p>
                	&bull; Medizin und Psychologie<br>
                    &bull; Technik und Naturwissenschaften<br>
                    &bull; Sozial- und Geisteswissenschaften<br>
					&bull; Kunst, Musik, Film und Literatur<br>
					&bull; Reiseb&uuml;cher, Natur, Tiere, Pflanzen, (Land-)Karten<br>
					&bull; Lexika und Nachschlagewerke<br>
					&bull; Biografien<br>
					&bull; Essen und Trinken<br>
                </p>
                <p>
               Innerhalb der Sachb&uuml;cher stellt das Kochbuch einen Teilbereich eben dieser dar. Das Kochbuch wird in den Sachbuchbereich „Essen und Trinken“ eingeordnet. Einzige Ausnahme sind hierbei spezielle Lehrb&uuml;cher für angehende Berufsk&ouml;che, die den Lehrb&uuml;chern zugeordnet werden k&ouml;nnen. 
Kochb&uuml;cher k&ouml;nnen grundlegend in die folgenden drei Kategorien eingeteilt werden: 
				</p>
                <p>
					&bull; Illustrierte Kochb&uuml;cher mit ausf&uuml;hrlichen Anleitungen zur Zubereitung, h&auml;ufig erg&auml;nzt durch Anmerkungen zur Herkunft des Rezepts oder dessen Zutaten<br>
                    &bull; Sammlung von Rezepten (oftmals Grundlagenrezepte) zur Vermittlung von Wissen an Lehrlinge in der Ausbildung zum Berufskoch<br>
                    &bull; Rezeptsammlungen (normalerweise ohne detaillierte Anleitung) f&uuml;r Berufsk&ouml;che, die bereits weitergehende Kenntnisse der Speisenzubereitung haben<br>
                </p>
                <h2>Geschichtliche Entwicklung des Sachbuches</h2>
                <p>Das Sachbuch hat in der heutigen Form erstmalig im  Sp&auml;tmittelalter seinen Ursprung. Damals wurde es vor allem zur Weitergabe von  Wissen an weitere Personen verwendet, die bereits selbst Erfahrungen oder eine  Ausbildung auf diesem Gebiet hatten. Dabei lag das Hauptaugenmerk darauf das erlangte  Wissen nicht der breiten Masse zur Verf&uuml;gung zu stellen, sondern als geheimes  Wissen in geschriebener Form an eine sehr stark eingeschr&auml;nkte Leserschaft zu  vermitteln. Vor dem Sachbuch war es allgemein &uuml;blich erlangtes Wissen fast  ausschlie&szlig;lich m&uuml;ndlich an die zu unterweisende Personen weiterzugeben. </p>
<p>Auch war das Sachbuch zum damaligen Zeitpunkt noch sehr  beschr&auml;nkt in der Streuung der Fachrichtungen. So waren die vermutlich ersten  Sachb&uuml;cher von der Art eines Almanaches oder Nachschlagewerkes. Diese Kategorien  wurden dann erweitert durch B&uuml;cher und Texte zu einzelnen Gebieten der Medizin,  Technik und der Naturwissenschaften. </p>
<p>Erst im 17. und 18. Jahrhundert wurde das Sachbuch durch eine  Reihe weiterer Kategorien erg&auml;nzt. So etwa durch Reiseberichte, philosophische  Texte, B&uuml;cher zur Natur und deren Flora und Fauna. Dies ging gleichzeitig  einher mit einer st&auml;rkeren Verbreitung des Buches als Informationsquelle f&uuml;r immer  mehr Menschen, da das Buch als Informationsmedium nun nichtmehr fast ausschließlich den Reichen und M&auml;chtigen zur Verf&uuml;gung stand, sondern  mittlerweile auch dem wohlhabenderen B&uuml;rgertum. </p>
<p>Mit Beginn des 19. Jahrhunderts kam die Verfassung von Biografien und historischen Texten in Mode. Dies hatte zur Folge, dass eine Reihe von Sachb&uuml;chern zu historisch bedeutenden Pers&ouml;nlichkeiten und Ereignissen  publiziert wurden. Anfangs nur zu politischen und adligen Personen, aber schon recht bald auch zu Pers&ouml;nlichkeiten von gesellschaftlicher oder wirtschaftlicher Bedeutung. Auch entstanden nun vermehrt Sachb&uuml;cher zu  gesellschaftlich wichtigen Themen wie der Kunst und Literatur. Diese  Entwicklung setzte sich bis in die erste H&auml;lfte des 20. Jahrhunderts fort. </p>
<p>Mit dem Beginn des 20. Jahrhunderts gewann beispielsweise die autobiografische Erz&auml;hlweise immer mehr an Bedeutung, so etwa durch  Ver&ouml;ffentlichungen von Tageb&uuml;chern (z.B. Das Tagebuch der Anne Frank) oder vom  Autor selbst &uuml;ber sich verfasste Texte. Als weiterer bedeutender Zweig der Sachb&uuml;cher gewannen die Sachb&uuml;cher mit ratgeberischem Charakter immer mehr an Bedeutung. Diese wurden und werden auch heute noch in immer gr&ouml;&szlig;erer Zahl zu  einem stetig wachsenden Themengebiet verfasst und publiziert. </p>
                
              <h2>Geschichtliche Entwicklung des Kochbuches</h2>
				<p>Bereits in den Erz&auml;hlungen der Antike fanden sich erste  Anleitungen zu Essenzubereitung, so etwa in der Odyssee des Homer, in der vom  Schweinhirten Eumaios die Rede ist, der zu Ehren der R&uuml;ckkehr von Homer ein  Ferkel am Spieß mit wei&szlig;em Mehl bestreut und zu diesem honigs&uuml;&szlig;en Wein reicht. [1]  Aber auch im Alten Testament finden Essen Erw&auml;hnung, die einer speziellen  Kenntnis der Zubereitung bed&uuml;rfen: unges&auml;uerte Fladen oder Kuchen (3. Mose  7,12), Honigwaffeln (2. Mose 16, 31) oder Gem&uuml;se, haupts&auml;chlich Bohnen und Linsen,  aus denen Suppe gekocht wird (1. Mose 25, 34). [2]</p>
<p>Es gab auch zu den Zeiten der alten R&ouml;mer und Griechen ab dem 5. Jahrhundert v. Chr. schriftliche Ausarbeitungen zur Esskultur und Zubereitungsarten, wobei hierzu nur indirekte Erw&auml;hnungen erhalten sind, jedoch  kaum direkte Schriftst&uuml;cke. So z.B. bildliche Darstellungen von Essen und  Trinken oder Preise von Lebensmitteln zu der damaligen Zeit. Zu den wenigen erhaltenen Schriften z&auml;hlen bspw. <i>Cena Trimalchionis</i> vom r&ouml;mischen Dichter Petronius, der in seinem Text eine satirische und &uuml;berspitzte Darstellung der Essgewohnheiten von Mitgliedern der r&ouml;mischen Oberschicht vornimmt. Als eines der wenigen vollst&auml;ndig &uuml;berlieferten Kochb&uuml;cher aus dieser Epoche gilt das aus zehn Einzelb&uuml;chern bestehende Kochbuch <i>De re coquinaria</i> vom Autor Apicius (Autorenschaft nicht eindeutig belegt). [2]</p>
<p>Die n&auml;chste gr&ouml;&szlig;ere Entwicklung bei den Kochb&uuml;chern fand im  13. und 14. Jahrhundert statt. Durch den zunehmenden Einfluss der islamischen  Welt und Kultur auf das christliche Abendland, vor allem durch den Handel mit Gew&uuml;rzen und weiteren bis dahin in Europa unbekannten Zutaten. Diese Kochb&uuml;cher  stammen vor allem aus Frankreich, Italien, den Niederlanden und aus D&auml;nemark. </p>
				<img src="buch_von_guter_spise.png" alt="image" width="60%"/>
			  	<figcaption class="label">
                	Erste Seite des Buches <i>buch von guter spise</i>
                    [4]</figcaption>
<p>Das erste deutschsprachige Kochbuch erschien um das Jahr 1345 unter dem Titel <i>buch von guter spise</i> von Eberhard von Landshut. Es sind  jedoch nur &Uuml;berlieferungen aus der zweiten H&auml;lfte des 15. Jahrhunderts  vorhanden. Die meisten der bekannten Kochb&uuml;cher sind Sammlungen von  handschriftlichen Einzelrezepten verschiedener Verfasser. Diese Kochb&uuml;cher sind  jedoch keine Kochb&uuml;cher im heutigen Sinne, sondern vielmehr eine sehr grobe  Anleitung zum Zubereiten von Speisen. Au&szlig;erdem sind die meisten der Anleitungen  zur Speisenzubereitung aus der adligen oder gehobenen Schicht, sodass in den Sammlungen kaum bis keine b&uuml;rgerlichen Rezepte enthalten sind. Es war des Weiteren &uuml;blich in diesen Textsammlungen neben den Anleitungen für Speisezubereitungen auch  Anleitungen und Hilfestellungen in Bezug auf Haushaltsf&uuml;hrung, Benehmen bei  Tisch oder Medizin miteinzuf&uuml;gen. [2]</p>
<p>Im 17. und 18. Jahrhundert fand das Kochbuch immer mehr  Verwendung in den gut-b&uuml;rgerlichen Schichten der Gesellschaft. Dadurch wurden  auch immer mehr einfache Rezepte Teil der niedergeschriebenen Rezepte. In den gut-b&uuml;rgerlichen Schichten kam es in Mode sich eine Art Familienrezeptbuch  zuzulegen, das nicht einmalig verfasst und gebunden wurde, sondern st&auml;ndig durch neue Rezepte erg&auml;nzt wurde. [3]</p>
<p>Mit Beginn des 19. Jahrhunderts wurde es auch &uuml;blich neben  den für den professionellen Gebrauch verfassten Kochb&uuml;chern nun auch die  Rezepte so zu formulieren und aufzubauen, dass diese auch durch Laien mit geringen Koch-Kenntnissen zubereitet werden k&ouml;nnen. Ebenso wurde nun eine klare Struktur in den Texten &uuml;blich: eine Zutatenliste und schrittweise Anweisungen zur Zubereitung. [3]</p>
<p>Diese Entwicklung setzte sich auch im 20. Jahrhundert bis in  die Neuzeit fort. Heutzutage gibt es eine F&uuml;lle von Kochb&uuml;chern, die neben klassischen Standardrezepten alle erdenklichen Kulturen und Herkunftsl&auml;nder bzw. -regionen abdecken. Es ist auch in Kochb&uuml;chern durchaus &uuml;blich neben der reinen Zubereitung eine Art Hintergrundgeschichte oder kulturelle Einordnung zum Rezept mitabzudrucken. Einzige Ausnahme bilden hier Lehrb&uuml;cher für angehende  Berufsk&ouml;che. Diese Kochb&uuml;cher sind weiterhin n&uuml;chtern für den rein professionellen Koch konzipiert. Das gedruckte Kochbuch wird mittlerweile erg&auml;nzt durch Kochsendungen und Internetportale mit Rezept-Datenbanken, die es dem Leser nun noch einfacher machen, an eine breite Vielfalt von Rezepten zu kommen. [3]</p>
			</section>
            
			<section id="impl">
				<h1>Implementationsreport (zum Praxisteil)</h1>
				<p>Die Idee des Projektes ist es, ein Pong Spiel zu entwickeln, bei dem man die Pong-Schläger mit Hilfe von Color Tracking steuert. Genauer heißt dass, man wählt eine Farbe aus, bei der die Durchschnittsposition in dem aktuellen Webcam Bild berechnet werden soll. Diese Position wird auf dem Pongschläger übertragen.</p>
				<p>Das Color Tracking wird in der Klasse „colorTracking.pde“ umgesetzt. Die Methode „Initialize“ macht das Webcam Bild zugänglich. Generell wird das Webcam Bild in zwei Hälften aufgeteilt, um in jeder Hälfte eine Farbe unabhängig verfolgen zu können. Die Methode „updateVideo“ wird für jeden Frame einmal aufgerufen. Sie macht die Pixeldaten des aktuellen Bilds zugänglich und ruft die Methoden „calculateAvrgRight“ und „calcualteAvrgLeft“ auf. Diese Methoden machen das selbe einmal für die linke und einmal für die rechte Bildhälfte. Sie iterieren über jeden Pixel der entsprechenden Hälfte und überprüfen ob der Farbwert innerhalb der erlaubten Differenz zu dem vorgegebenen Farbwert liegt. Diese erlaubte Differenz nennen wir „acceptedColorRange“. Es wird dazu jeweils der Rot-, Grün- und Blau Wert der Farbe des Pixels von den Rot-, Grün- und Blauwerten der zu verfolgenden Farbe abgezogen und quadriert um keine negativen Werte zu erhalten. Ist das Ergebnis dieser Rechnung kleiner als „acceptedColorRange“ ins Quadrat, wissen wir, dass es sich hier um ein Pixel handelt, den wir als gleiche Farbe zur vorgegeben Farbe akzeptieren. Wir addieren dann den X-Wert des Pixels zu einer Summe aller X-Werte von akzeptieren Pixeln und erhöhen den Zähler der erkannten Pixel um eins. Das selbe geschieht für die Y-Wert. Hat man dies für alle Pixel in einer Hälfte gemacht, kann man die Summe der X-Werte durch die Anzahl der akzeptierten Pixel teilen und erhält die durchschnittliche X-Position der Farbe im Bild. Diese Position machen wir mit den Variable „avrgXLeft“ und „avrgXRight“ für alle Klassen zugänglich.</p>
				<p>Die aktuelle Farbe, also die Farbe, die wir „tracken“ wollen, kann man auswählen, in dem man mit der Maus auf einen Pixel klickt. Das kann man für beide Bildschirmhälften machen. Der Farbwert, der damit ausgewählt wurde, wird in „colorToTrackLeft“ bzw. „colorToTrackRight“ gespeichert.</p>
				<p>Mit „+“ und „-“ Tasten kann man die „AcceptedColorRange“ in 10-er Schritten ändern.</p>
				<p>Dieser simple Color Tracking Algorithmus funktioniert für unser Vorhaben recht gut, wenn man auf zwei Bedingungen achtet. Der Gegenstand, den man verfolgen möchte, sollte eine Farbe haben, die nicht im Hintergrund auftritt. Ist im Bild noch ein anderer Gegenstand mit derselben Farbe, so wir als Durchschnittsposition die mittlere Position der zwei Gegenstände berechnet.
					<br>Die zweite Schwäche tritt auf, wenn ungleichmäßige Lichtverhältnisse herrschen. Wird die Farbe des verfolgenden Gegenstands in einem dunkleren Bildbereich ausgewählt, so ändert sich der Farbwert des Gegenstands im Bild, wenn man ihn in einen helleren Bereich bewegt. Jedoch ist die eingestellte Farbe immer noch die Farbe des Gegenstands im dunklen Bereich.</p>
				<p>TODO: Abschnitt zu Pong umsetztung</p>
			
			</section>
			<section id="references">
				<h1>Referenzen</h1>
				<ol>
					<li>[1] Homer, Die Odyssee, 14. Gesang, V. 72-82 (in der &Uuml;bersetzung von Johann Heinrich Vo&szlig;)</li>
					<li>[2] RECK, Alexander. Die deutschsprachigen Kochb&uuml;cher des Mittelalters. Mitteilungen des Instituts für &Ouml;sterreichische Geschichtsforschung, 2001, 109. Jg., Nr. JG, S. 82-104.</li>
					<li>[3] C&Ouml;LFEN, Hermann. Vom Kochrezept zur Kochanleitung. Sprachliche und mediale Aspekte einer verst&auml;ndlichen Vermittlung von Kochkenntnissen, 2007.</li>
                    <li>[4] Bildquelle: https://upload.wikimedia.org/wikipedia/de/0/04/BvgSp_fol._156r.png</li>
				</ol>
			</section>
		</article>
	</body>
</html>
